Revit 2025 API
Rebar.SetHookOrientation Method
 Defines the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public void SetHookOrientation(
	int iEnd,
	RebarHookOrientation hookOrientation
)
Public Sub SetHookOrientation (
	iEnd As Integer,
	hookOrientation As RebarHookOrientation
)
public:
void SetHookOrientation(
	int iEnd,
	RebarHookOrientation hookOrientation
)
member SetHookOrientation :
        iEnd : int *
        hookOrientation : RebarHookOrientation -> unit
Parameters
iEnd Int32
 0 for the start hook, 1 for the end hook.
hookOrientation RebarHookOrientation
 Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  iEnd must be 0 or 1. -or- A value passed for an enumeration argument is not a member of that enumeration
Remarks
 If RebarShapeDefinesHooks property of ReinforcementSettings is true (non-European shapes), setHookOrientation method does nothing.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace